{
    "Apple___Apple_scab": "Prune infected leaves, apply fungicide sprays, and avoid overhead watering.",
    "Apple___Black_rot": "Remove infected fruits and twigs, apply fungicides during early bloom.",
    "Apple___Cedar_apple_rust": "Remove nearby cedar trees, use rust-resistant varieties, apply fungicides.",
    "Apple___healthy": "Tree is healthy. Maintain regular care and monitor for early signs of disease.",
    "Background_without_leaves": "No plant detected. Please upload an image containing a leaf or fruit.",
    "Blueberry___healthy": "Plant is healthy. Ensure proper soil pH and regular watering.",
    "Cherry___Powdery_mildew": "Apply sulfur or potassium bicarbonate sprays, improve air circulation.",
    "Cherry___healthy": "Tree is healthy. Continue with regular fertilizing and pest monitoring.",
    "Corn___Cercospora_leaf_spot Gray_leaf_spot": "Rotate crops, use resistant hybrids, and apply fungicides.",
    "Corn___Common_rust": "Use resistant varieties, apply fungicides if severe.",
    "Corn___Northern_Leaf_Blight": "Apply fungicides early, use disease-resistant hybrids, and rotate crops.",
    "Corn___healthy": "Crop is healthy. Practice crop rotation and maintain field hygiene.",
    "Grape___Black_rot": "Prune infected parts, remove mummified fruits, and use fungicide treatments.",
    "Grape___Esca_(Black_Measles)": "Remove and destroy infected vines, avoid water stress, manage pruning wounds.",
    "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)": "Improve airflow, prune affected areas, apply fungicides.",
    "Grape___healthy": "Plant is healthy. Keep monitoring and apply preventive fungicides as needed.",
    "Orange___Haunglongbing_(Citrus_greening)": "Remove infected trees, control psyllid vectors, use certified disease-free stock.",
    "Peach___Bacterial_spot": "Use resistant cultivars, apply copper sprays, avoid leaf wetness.",
    "Peach___healthy": "Tree is healthy. Continue regular pruning and pest inspection.",
    "Pepper,_bell___Bacterial_spot": "Use disease-free seeds, rotate crops, and apply copper-based bactericides.",
    "Pepper,_bell___healthy": "Plant is healthy. Monitor regularly and ensure proper spacing.",
    "Potato___Early_blight": "Apply fungicides like chlorothalonil, remove infected foliage.",
    "Potato___Late_blight": "Use certified seed potatoes, apply appropriate fungicides, remove infected plants.",
    "Potato___healthy": "Plant is healthy. Ensure balanced nutrition and pest management.",
    "Raspberry___healthy": "Plant is healthy. Maintain good airflow and mulch properly.",
    "Soybean___healthy": "Crop is healthy. Keep soil nutrients balanced and scout for pests.",
    "Squash___Powdery_mildew": "Apply sulfur-based fungicides, improve air flow, avoid overhead watering.",
    "Strawberry___Leaf_scorch": "Remove infected leaves, improve spacing, use resistant varieties.",
    "Strawberry___healthy": "Plant is healthy. Ensure proper irrigation and pest control.",
    "Tomato___Bacterial_spot": "Use copper-based sprays, avoid handling when wet, use certified seeds.",
    "Tomato___Early_blight": "Remove lower leaves, apply fungicides, use crop rotation.",
    "Tomato___Late_blight": "Destroy affected plants, avoid overhead watering, apply fungicides.",
    "Tomato___Leaf_Mold": "Use sulfur-based fungicides, remove infected leaves, ventilate greenhouses.",
    "Tomato___Septoria_leaf_spot": "Remove infected leaves, apply fungicides, rotate crops yearly.",
    "Tomato___Spider_mites Two-spotted_spider_mite": "Use neem oil or insecticidal soap, increase humidity.",
    "Tomato___Target_Spot": "Apply protective fungicides, remove diseased foliage, rotate crops.",
    "Tomato___Tomato_Yellow_Leaf_Curl_Virus": "Remove infected plants, control whiteflies, use resistant varieties.",
    "Tomato___Tomato_mosaic_virus": "Destroy infected plants, disinfect tools, control aphid population.",
    "Tomato___healthy": "Plant is healthy. Maintain proper care and observe for any early signs."
}